----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\admini\Desktop\硕士\人口分析技术\动态人口金字塔_Stata\ChinaPyramid.log
  log type:  text
 opened on:  24 Oct 2020, 18:34:33

. import delimited $raw_data\china.csv
(9 vars, 8282 obs)

. 
. egen age_all = cut(age), at(0,5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,95,100,200)

. egen age_group = group(age_all)

. label var age_group "年龄组别"

. label def 年龄组别 1 "0-4"  2 "5-9" 3 "10-14" 4 "14-19" 5"20-24" 6 "25-29" 7 "30-34" 8 "35-39" ///
>  9 "40-44" 10 "45-49" 11 "50-54" 12 "55-59" 13 "60-64" 14 "65-69" 15 "70-74" 16 "75-79" 17 "80-84" 18 "85-89" ///
>  19 "90-94" 20 "95-100" 21 "100+", replace

. 
. reshape wide pop , i(v1) j(time)
(note: j = 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 2026 2027 2028 2029 2030 2031 2032 2033
>  2034 2035 2036 2037 2038 2039 2040 2041 2042 2043 2044 2045 2046 2047 2048 2049 2050)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     8282   ->    8282
Number of variables                  11   ->      50
j variable (41 values)             time   ->   (dropped)
xij variables:
                                    pop   ->   pop2010 pop2011 ... pop2050
-----------------------------------------------------------------------------

. 
. forvalues i = 2010(1)2050 {
  2.  gen popMale_`i'=pop`i' if sex=="Male"
  3.  gen popFemale_`i'=pop`i' if sex=="Female"
  4.  }
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)
(8,181 missing values generated)

. 
. 
end of do-file

. do "C:\Users\admini\AppData\Local\Temp\STD00000000.tmp"

. save $resultfiles\ChinaPyramid.dta, replace
(note: file C:\Users\admini\Desktop\硕士\人口分析技术\动态人口金字塔_Stata\ChinaPyramid.dta not found)
file C:\Users\admini\Desktop\硕士\人口分析技术\动态人口金字塔_Stata\ChinaPyramid.dta saved

. 
end of do-file

. exit, clear
